# Number of terms = 563
0	429
1	107
2	191
3	99
4	54
5	35
6	468
7	353
8	40
9	604
10	145
11	136
12	130
13	444
14	284
15	536
16	134
17	436
18	242
19	314
20	574
21	385
22	349
23	46
24	584
25	476
26	192
27	14
28	411
29	541
30	273
31	56
32	102
33	455
34	162
35	229
36	26
37	447
38	243
39	592
40	485
41	404
42	142
43	507
44	394
45	498
46	588
47	8
48	486
49	176
50	262
51	170
52	602
53	179
54	109
55	38
56	235
57	512
58	395
59	386
60	321
61	530
62	173
63	94
64	133
65	446
66	117
67	501
68	37
69	81
70	181
71	559
72	6
73	458
74	126
75	565
76	373
77	609
78	379
79	5
80	347
81	121
82	58
83	174
84	340
85	43
86	566
87	470
88	374
89	240
90	569
91	402
92	31
93	544
94	206
95	269
96	524
97	521
98	270
99	214
100	451
101	150
102	302
103	529
104	151
105	589
106	90
107	32
108	456
109	84
110	389
111	276
112	437
113	120
114	337
115	277
116	492
117	71
118	350
119	171
120	44
121	364
122	372
123	304
124	481
125	360
126	85
127	163
128	128
129	297
130	11
131	283
132	149
133	467
134	575
135	595
136	535
137	412
138	201
139	33
140	156
141	315
142	268
143	597
144	199
145	263
146	208
147	547
148	93
149	140
150	236
151	383
152	266
153	554
154	118
155	115
156	4
157	572
158	577
159	197
160	225
161	45
162	245
163	587
164	59
165	603
166	217
167	579
168	267
169	465
170	414
171	155
172	188
173	27
174	430
175	607
176	96
177	1
178	265
179	469
180	333
181	19
182	57
183	294
184	571
185	409
186	101
187	591
188	160
189	368
190	224
191	453
192	546
193	292
194	299
195	474
196	450
197	195
198	216
199	288
200	39
201	324
202	202
203	290
204	355
205	244
206	79
207	555
208	113
209	422
210	13
211	410
212	183
213	157
214	384
215	457
216	516
217	42
218	367
219	164
220	494
221	493
222	234
223	500
224	255
225	238
226	135
227	452
228	448
229	69
230	532
231	392
232	313
233	391
234	186
235	531
236	527
237	198
238	558
239	479
240	325
241	342
242	108
243	312
244	95
245	97
246	185
247	9
248	293
249	165
250	104
251	275
252	427
253	449
254	303
255	20
256	182
257	518
258	311
259	169
260	504
261	232
262	310
263	82
264	425
265	309
266	66
267	346
268	387
269	226
270	100
271	36
272	482
273	438
274	7
275	23
276	594
277	260
278	287
279	194
280	221
281	552
282	428
283	316
284	218
285	396
286	502
287	488
288	91
289	608
290	286
291	336
292	250
293	478
294	462
295	48
296	144
297	264
298	510
299	257
300	289
301	463
302	61
303	259
304	167
305	423
306	132
307	68
308	75
309	370
310	513
311	64
312	187
313	34
314	542
315	178
316	381
317	399
318	129
319	580
320	473
321	274
322	606
323	110
324	161
325	483
326	540
327	480
328	254
329	593
330	570
331	397
332	281
333	307
334	573
335	416
336	166
337	359
338	278
339	219
340	230
341	354
342	477
343	343
344	147
345	361
346	137
347	74
348	301
349	72
350	322
351	420
352	553
353	239
354	138
355	375
356	403
357	334
358	223
359	356
360	200
361	220
362	543
363	51
364	318
365	175
366	271
367	28
368	327
369	369
370	440
371	600
372	53
373	172
374	545
375	568
376	12
377	390
378	78
379	522
380	590
381	207
382	215
383	335
384	127
385	431
386	508
387	22
388	180
389	434
390	87
391	464
392	605
393	454
394	320
395	330
396	253
397	499
398	158
399	92
400	405
401	406
402	505
403	15
404	578
405	17
406	3
407	168
408	585
409	538
410	29
411	398
412	421
413	146
414	55
415	432
416	213
417	419
418	295
419	326
420	490
421	351
422	520
423	204
424	88
425	442
426	539
427	489
428	83
429	503
430	124
431	116
432	358
433	377
434	484
435	345
436	86
437	472
438	249
439	280
440	357
441	131
442	211
443	332
444	246
445	70
446	576
447	460
448	228
449	376
450	435
451	562
452	21
453	80
454	16
455	282
456	348
457	415
458	388
459	203
460	222
461	528
462	60
463	261
464	371
465	237
466	496
467	443
468	344
469	308
470	323
471	537
472	407
473	506
474	533
475	300
476	487
477	497
478	317
479	393
480	598
481	103
482	231
483	177
484	193
485	119
486	509
487	439
488	76
489	189
490	341
491	466
492	563
493	601
494	112
495	63
496	143
497	378
498	366
499	2
500	105
501	256
502	582
503	581
504	227
505	123
506	298
507	241
508	233
509	441
510	285
511	511
512	152
513	426
514	557
515	291
516	139
517	445
518	18
519	10
520	424
521	495
522	41
523	24
524	534
525	305
526	339
527	196
528	319
529	122
530	418
531	73
532	549
533	106
534	408
535	247
536	52
537	560
538	251
539	210
540	125
541	525
542	564
543	610
544	583
545	148
546	413
547	114
548	154
549	517
550	548
551	365
552	550
553	212
554	561
555	49
556	380
557	352
558	328
559	65
560	47
561	471
562	475
