# Number of terms = 8389
0	22
1	150
2	161
3	165
4	218
5	222
6	225
7	227
8	343
9	349
10	351
11	420
12	421
13	432
14	434
15	468
16	588
17	590
18	592
19	595
20	48
21	60
22	151
23	168
24	169
25	185
26	186
27	195
28	204
29	207
30	208
31	234
32	236
33	237
34	252
35	256
36	257
37	261
38	266
39	270
40	274
41	276
42	279
43	281
44	282
45	289
46	292
47	294
48	300
49	315
50	316
51	317
52	329
53	339
54	380
55	381
56	553
57	164
58	1
59	2
60	5
61	11
62	62
63	104
64	105
65	140
66	141
67	6
68	16
69	17
70	21
71	25
72	32
73	36
74	52
75	58
76	85
77	94
78	95
79	99
80	111
81	494
82	581
83	608
84	668
85	720
86	34
87	39
88	72
89	110
90	144
91	148
92	153
93	155
94	158
95	159
96	160
97	162
98	175
99	213
100	215
101	223
102	224
103	229
104	230
105	235
106	246
107	347
108	348
109	417
110	427
111	47
112	50
113	178
114	193
115	194
116	265
117	269
118	272
119	283
120	288
121	293
122	296
123	299
124	303
125	306
126	307
127	308
128	312
129	314
130	318
131	319
132	337
133	496
134	673
135	10
136	23
137	122
138	145
139	163
140	228
141	231
142	344
143	413
144	416
145	435
146	196
147	248
148	253
149	259
150	325
151	333
152	555
153	205
154	342
155	410
156	19
157	173
158	172
159	216
160	431
161	280
162	112
163	70
164	457
165	267
166	593
167	198
168	364
169	328
170	454
171	275
172	367
173	340
174	509
175	9
176	442
177	330
178	585
179	353
180	180
181	355
182	69
183	552
184	31
185	44
186	273
187	203
188	327
189	610
190	107
191	440
192	616
193	551
194	350
195	46
196	515
197	26
198	376
199	146
200	371
201	491
202	609
203	383
204	362
205	514
206	82
207	199
208	126
209	121
210	685
211	277
212	708
213	188
214	332
215	426
216	611
217	76
218	92
219	183
220	366
221	606
222	117
223	184
224	220
225	285
226	742
227	311
228	636
229	724
230	170
231	14
232	181
233	233
234	177
235	637
236	338
237	437
238	15
239	132
240	174
241	688
242	239
243	255
244	471
245	93
246	356
247	589
248	736
249	377
250	474
251	480
252	20
253	704
254	485
255	357
256	500
257	370
258	433
259	539
260	520
261	415
262	45
263	232
264	527
265	368
266	335
267	419
268	516
269	445
270	262
271	597
272	531
273	508
274	587
275	586
276	497
277	502
278	258
279	466
280	594
281	8
282	418
283	575
284	250
285	455
286	532
287	519
288	374
289	361
290	596
291	542
292	450
293	460
294	505
295	569
296	536
297	568
298	7
299	648
300	524
301	653
302	125
303	41
304	249
305	444
306	372
307	537
308	412
309	358
310	422
311	535
312	373
313	305
314	540
315	707
316	733
317	477
318	73
319	313
320	13
321	378
322	4
323	448
324	784
325	728
326	529
327	534
328	191
329	661
330	382
331	489
332	271
333	345
334	546
335	464
336	544
337	745
338	472
339	453
340	493
341	786
342	783
343	12
344	171
345	761
346	802
347	780
348	290
349	475
350	647
351	533
352	24
353	405
354	490
355	240
356	788
357	481
358	384
359	97
360	100
361	428
362	778
363	42
364	766
365	147
366	217
367	3
368	86
369	206
370	639
371	469
372	260
373	322
374	57
375	640
376	334
377	28
378	538
379	135
380	808
381	501
382	805
383	176
384	354
385	550
386	861
387	29
388	482
389	543
390	18
391	154
392	346
393	743
394	1027
395	1020
396	1032
397	1021
398	1033
399	1015
400	852
401	507
402	528
403	484
404	1024
405	1025
406	1022
407	1036
408	1012
409	1079
410	1023
411	1029
412	1028
413	1019
414	1080
415	1031
416	1007
417	1017
418	247
419	1081
420	1011
421	1009
422	1014
423	1013
424	1035
425	719
426	765
427	799
428	848
429	986
430	804
431	828
432	782
433	656
434	697
435	849
436	762
437	880
438	747
439	1073
440	27
441	61
442	628
443	709
444	662
445	103
446	671
447	924
448	618
449	830
450	79
451	631
452	157
453	360
454	1082
455	981
456	1084
457	667
458	548
459	65
460	89
461	66
462	87
463	711
464	179
465	352
466	54
467	102
468	302
469	818
470	838
471	304
472	458
473	510
474	291
475	243
476	43
477	254
478	842
479	88
480	694
481	209
482	310
483	839
484	219
485	700
486	212
487	801
488	835
489	336
490	710
491	189
492	837
493	891
494	113
495	251
496	201
497	210
498	996
499	881
500	359
501	867
502	999
503	888
504	775
505	1042
506	795
507	1004
508	1064
509	1006
510	1049
511	979
512	991
513	1061
514	1265
515	116
516	613
517	731
518	137
519	1059
520	1150
521	650
522	833
523	892
524	1056
525	1161
526	1356
527	238
528	810
529	1105
530	541
531	1219
532	1258
533	1215
534	1333
535	1339
536	1345
537	1350
538	1359
539	1367
540	1057
541	1361
542	1363
543	1391
544	1353
545	1136
546	1196
547	1197
548	1198
549	1200
550	1240
551	912
552	1214
553	1278
554	1099
555	1231
556	1246
557	1270
558	5060
559	1282
560	1302
561	40
562	68
563	619
564	626
565	1047
566	800
567	737
568	74
569	832
570	63
571	81
572	813
573	703
574	1390
575	1097
576	1101
577	1210
578	1291
579	969
580	1234
581	2019
582	1370
583	1242
584	1376
585	1250
586	119
587	913
588	1225
589	1193
590	1201
591	1374
592	1266
593	1272
594	1385
595	1275
596	1303
597	1220
598	1254
599	923
600	1208
601	1233
602	748
603	1371
604	1372
605	1373
606	1375
607	725
608	735
609	1405
610	1393
611	605
612	612
613	1183
614	83
615	1409
616	858
617	1221
618	785
619	879
620	1429
621	1432
622	75
623	840
624	562
625	634
626	885
627	1173
628	1092
629	1041
630	1416
631	1357
632	1411
633	617
634	1060
635	1366
636	1046
637	1414
638	791
639	1034
640	896
641	1417
642	1144
643	1358
644	1116
645	1137
646	984
647	1442
648	78
649	627
650	1407
651	1438
652	1425
653	1459
654	1458
655	1104
656	1103
657	1086
658	1224
659	64
660	1167
661	706
662	446
663	326
664	214
665	321
666	452
667	369
668	331
669	287
670	1090
671	1077
672	1172
673	1213
674	1096
675	1271
676	920
677	1094
678	55
679	904
680	1207
681	1259
682	919
683	1228
684	1293
685	1263
686	908
687	1185
688	1203
689	1299
690	1307
691	1124
692	1280
693	914
694	1300
695	722
696	953
697	1292
698	902
699	1247
700	1408
701	726
702	1131
703	1343
704	1276
705	1394
706	1132
707	1177
708	1304
709	926
710	1217
711	1230
712	1295
713	899
714	910
715	1296
716	1488
717	1204
718	211
719	1095
720	1396
721	1171
722	1268
723	1093
724	1206
725	1120
726	1267
727	898
728	1269
729	324
730	922
731	1244
732	954
733	1387
734	1186
735	909
736	1235
737	916
738	955
739	915
740	951
741	1288
742	900
743	933
744	1179
745	1285
746	971
747	1227
748	1189
749	931
750	948
751	1290
752	1380
753	932
754	934
755	1190
756	1184
757	1305
758	1395
759	1187
760	1010
761	1191
762	1388
763	1381
764	1286
765	1088
766	1135
767	691
768	1346
769	987
770	1194
771	580
772	1018
773	1091
774	406
775	836
776	1043
777	467
778	829
779	809
780	1431
781	1485
782	1476
783	886
784	692
785	1474
786	1499
787	990
788	1544
789	663
790	903
791	1527
792	1517
793	781
794	741
795	1211
796	1306
797	1127
798	1287
799	1222
800	1377
801	1199
802	1281
803	1297
804	1238
805	574
806	1283
807	1301
808	1298
809	714
810	1051
811	869
812	1151
813	1454
814	1089
815	1148
816	994
817	750
818	1566
819	1580
820	1552
821	798
822	889
823	1584
824	1601
825	1602
826	1608
827	1586
828	1464
829	1479
830	1483
831	1589
832	1597
833	1603
834	1055
835	1515
836	1590
837	1245
838	4006
839	1274
840	1257
841	1249
842	1610
843	1188
844	1352
845	1261
846	1351
847	1401
848	1129
849	387
850	1243
851	556
852	71
853	1378
854	1344
855	1347
856	882
857	1466
858	1690
859	1500
860	1617
861	1653
862	1693
863	1729
864	1672
865	1721
866	1620
867	1465
868	1629
869	1615
870	1662
871	1588
872	1614
873	1605
874	1687
875	1676
876	1665
877	1711
878	1625
879	1747
880	1616
881	1639
882	1647
883	1754
884	1422
885	1646
886	1626
887	1704
888	1641
889	1643
890	1446
891	1633
892	1635
893	1719
894	1730
895	1683
896	1596
897	1694
898	1696
899	1449
900	1480
901	53
902	1140
903	1237
904	1519
905	1624
906	1587
907	1100
908	1320
909	1688
910	1717
911	1837
912	1722
913	1726
914	1805
915	1835
916	1777
917	1784
918	1810
919	1821
920	1569
921	1573
922	1686
923	1594
924	1066
925	935
926	940
927	905
928	965
929	911
930	942
931	943
932	945
933	1284
934	866
935	1645
936	1732
937	1518
938	2952
939	1037
940	1556
941	1917
942	1918
943	1840
944	1882
945	1541
946	2124
947	2082
948	1965
949	2011
950	2012
951	1253
952	2038
953	2094
954	2021
955	2091
956	1831
957	379
958	1334
959	2034
960	2028
961	2002
962	511
963	1604
964	1909
965	1923
966	2027
967	2316
968	2141
969	2006
970	2424
971	2433
972	2321
973	2393
974	2396
975	2496
976	1855
977	2501
978	2324
979	2390
980	2394
981	2493
982	2334
983	2384
984	2125
985	1365
986	389
987	2294
988	1907
989	1876
990	1682
991	2322
992	2279
993	2571
994	2542
995	2583
996	2587
997	2504
998	2505
999	2567
1000	2581
1001	2598
1002	2617
1003	2506
1004	2580
1005	2574
1006	2606
1007	2539
1008	2541
1009	2572
1010	2599
1011	2500
1012	2538
1013	2548
1014	2560
1015	2497
1016	2558
1017	2605
1018	2568
1019	2436
1020	2566
1021	2622
1022	2623
1023	2629
1024	430
1025	2628
1026	2431
1027	2320
1028	1680
1029	2549
1030	2762
1031	2761
1032	2353
1033	2078
1034	2770
1035	1966
1036	1912
1037	2336
1038	2706
1039	2858
1040	2881
1041	2882
1042	2724
1043	2829
1044	2805
1045	2692
1046	2573
1047	2700
1048	2570
1049	2490
1050	2671
1051	2447
1052	2683
1053	2702
1054	2860
1055	2445
1056	2482
1057	2688
1058	2890
1059	2886
1060	2709
1061	2710
1062	2712
1063	2759
1064	2883
1065	2763
1066	2828
1067	2861
1068	2719
1069	2720
1070	2918
1071	2915
1072	2289
1073	1537
1074	1848
1075	2064
1076	2109
1077	2150
1078	2935
1079	2239
1080	2108
1081	936
1082	1914
1083	1883
1084	2278
1085	1953
1086	1252
1087	1147
1088	1797
1089	1289
1090	2076
1091	950
1092	2485
1093	930
1094	2243
1095	2398
1096	1562
1097	1321
1098	2115
1099	2145
1100	2302
1101	2906
1102	2528
1103	2406
1104	2943
1105	2058
1106	2391
1107	2333
1108	2357
1109	2443
1110	1658
1111	715
1112	1885
1113	2268
1114	1799
1115	1545
1116	1678
1117	1673
1118	2272
1119	2291
1120	1801
1121	1399
1122	385
1123	1888
1124	1542
1125	2310
1126	2875
1127	2112
1128	1621
1129	1487
1130	1841
1131	2355
1132	2690
1133	2080
1134	2248
1135	2249
1136	1968
1137	2245
1138	2136
1139	2262
1140	2100
1141	2174
1142	2716
1143	2796
1144	1963
1145	2349
1146	947
1147	1689
1148	1162
1149	2065
1150	1684
1151	1354
1152	1783
1153	1264
1154	2467
1155	2752
1156	2132
1157	599
1158	1251
1159	1947
1160	2085
1161	2067
1162	2529
1163	2553
1164	1262
1165	1949
1166	2729
1167	2863
1168	2015
1169	2554
1170	2870
1171	2896
1172	2951
1173	2841
1174	2630
1175	2593
1176	2925
1177	1964
1178	2640
1179	1125
1180	2178
1181	2351
1182	1892
1183	1958
1184	2231
1185	2717
1186	2130
1187	2416
1188	2973
1189	1273
1190	2000
1191	2001
1192	2247
1193	2182
1194	1791
1195	423
1196	2344
1197	365
1198	1911
1199	2802
1200	2956
1201	2403
1202	2641
1203	2511
1204	2694
1205	2797
1206	2912
1207	2723
1208	2395
1209	101
1210	2023
1211	2144
1212	1701
1213	2517
1214	1845
1215	1945
1216	2014
1217	2313
1218	1956
1219	1212
1220	2301
1221	1938
1222	2427
1223	2252
1224	1897
1225	2171
1226	2815
1227	2670
1228	2527
1229	1178
1230	2003
1231	1441
1232	2819
1233	2359
1234	2840
1235	2563
1236	2953
1237	1223
1238	1873
1239	2266
1240	1111
1241	2502
1242	2475
1243	1916
1244	1954
1245	2087
1246	1277
1247	1502
1248	2699
1249	2916
1250	2140
1251	1748
1252	2455
1253	2054
1254	3063
1255	3064
1256	2997
1257	1392
1258	1581
1259	492
1260	3060
1261	1550
1262	2387
1263	1648
1264	1906
1265	441
1266	1967
1267	2987
1268	988
1269	2990
1270	1415
1271	2081
1272	2020
1273	2405
1274	2419
1275	1674
1276	1957
1277	2022
1278	2352
1279	1961
1280	1962
1281	2114
1282	2194
1283	2240
1284	3019
1285	3068
1286	2988
1287	2551
1288	2639
1289	2410
1290	2420
1291	2474
1292	1959
1293	2146
1294	2348
1295	2928
1296	2950
1297	2290
1298	2411
1299	2421
1300	3071
1301	2734
1302	2749
1303	3029
1304	2804
1305	1078
1306	1997
1307	2409
1308	2521
1309	2971
1310	2013
1311	2523
1312	2303
1313	2367
1314	4424
1315	615
1316	1955
1317	1982
1318	2116
1319	3037
1320	2524
1321	2921
1322	1030
1323	2779
1324	2877
1325	2991
1326	3040
1327	2522
1328	2871
1329	2040
1330	2407
1331	2369
1332	2470
1333	1663
1334	2133
1335	2134
1336	2110
1337	2471
1338	2795
1339	2413
1340	2463
1341	2518
1342	2241
1343	2259
1344	2423
1345	2457
1346	2468
1347	2478
1348	2735
1349	3039
1350	3072
1351	2088
1352	3033
1353	2746
1354	2794
1355	2073
1356	2371
1357	2791
1358	3067
1359	2155
1360	2707
1361	2186
1362	2476
1363	2366
1364	2985
1365	2273
1366	2288
1367	2872
1368	2414
1369	1627
1370	1769
1371	2993
1372	2948
1373	2949
1374	2989
1375	2944
1376	2947
1377	2402
1378	2126
1379	1112
1380	2105
1381	459
1382	998
1383	1248
1384	2919
1385	3102
1386	2859
1387	2917
1388	3074
1389	2312
1390	3104
1391	2822
1392	2077
1393	2167
1394	1894
1395	558
1396	1779
1397	1591
1398	1606
1399	2153
1400	2103
1401	2161
1402	2193
1403	2968
1404	2459
1405	2657
1406	1998
1407	3024
1408	3052
1409	2596
1410	2718
1411	2806
1412	3006
1413	2996
1414	2961
1415	2977
1416	3115
1417	2686
1418	2546
1419	1994
1420	698
1421	1884
1422	2096
1423	2149
1424	2857
1425	901
1426	907
1427	1951
1428	1760
1429	2017
1430	3168
1431	2070
1432	2820
1433	2282
1434	718
1435	2995
1436	2378
1437	2329
1438	2959
1439	2428
1440	3113
1441	2792
1442	487
1443	1379
1444	3155
1445	3114
1446	1772
1447	2195
1448	3142
1449	2097
1450	2908
1451	3082
1452	2253
1453	759
1454	2843
1455	1733
1456	190
1457	2203
1458	3044
1459	1834
1460	2267
1461	2701
1462	1895
1463	476
1464	3108
1465	3020
1466	1866
1467	2812
1468	2300
1469	3169
1470	1952
1471	1950
1472	3093
1473	3167
1474	3011
1475	3073
1476	2788
1477	1931
1478	2430
1479	3153
1480	2046
1481	952
1482	1939
1483	3035
1484	3066
1485	1960
1486	3062
1487	3143
1488	2117
1489	2374
1490	2942
1491	3109
1492	2264
1493	2415
1494	3175
1495	3156
1496	3117
1497	1836
1498	2764
1499	2616
1500	1256
1501	3134
1502	2941
1503	3022
1504	3030
1505	3096
1506	2361
1507	3088
1508	946
1509	1948
1510	921
1511	2926
1512	2750
1513	3099
1514	2946
1515	3076
1516	3087
1517	1513
1518	2732
1519	2970
1520	3152
1521	3100
1522	3141
1523	3028
1524	764
1525	3130
1526	3173
1527	944
1528	2025
1529	1755
1530	2793
1531	1209
1532	3146
1533	2687
1534	3016
1535	3265
1536	424
1537	3264
1538	1753
1539	3253
1540	3042
1541	3200
1542	1130
1543	2648
1544	1974
1545	1975
1546	2633
1547	1970
1548	2004
1549	2327
1550	2454
1551	2775
1552	3256
1553	3255
1554	1727
1555	3107
1556	3178
1557	3270
1558	3176
1559	3147
1560	2731
1561	2083
1562	3177
1563	3258
1564	3243
1565	3249
1566	3247
1567	3248
1568	3274
1569	3268
1570	3254
1571	1921
1572	2311
1573	2672
1574	1862
1575	3269
1576	3224
1577	3341
1578	3283
1579	2131
1580	3223
1581	3301
1582	1642
1583	1457
1584	2042
1585	1005
1586	2052
1587	2739
1588	3101
1589	3106
1590	3196
1591	3257
1592	3252
1593	3360
1594	3396
1595	2005
1596	3316
1597	3421
1598	3406
1599	3471
1600	3435
1601	3436
1602	3445
1603	3448
1604	3449
1605	3388
1606	3450
1607	3451
1608	3467
1609	3426
1610	3468
1611	3469
1612	3414
1613	3403
1614	3402
1615	3404
1616	3418
1617	3363
1618	3361
1619	2738
1620	2874
1621	2151
1622	3244
1623	3358
1624	2469
1625	3260
1626	3473
1627	3504
1628	3506
1629	3507
1630	3492
1631	3503
1632	6460
1633	3489
1634	3461
1635	3479
1636	3498
1637	1927
1638	1944
1639	2075
1640	1631
1641	2550
1642	3230
1643	3075
1644	2160
1645	3204
1646	928
1647	906
1648	3386
1649	1428
1650	3462
1651	2726
1652	3408
1653	3298
1654	645
1655	3300
1656	3303
1657	3185
1658	3285
1659	3324
1660	3273
1661	1176
1662	1533
1663	2885
1664	803
1665	461
1666	2159
1667	1053
1668	1860
1669	1260
1670	2066
1671	2727
1672	320
1673	2940
1674	2008
1675	2488
1676	2256
1677	3344
1678	1349
1679	3476
1680	2747
1681	968
1682	2118
1683	2377
1684	2976
1685	3081
1686	1128
1687	1332
1688	2901
1689	2772
1690	3203
1691	2575
1692	2318
1693	3160
1694	3219
1695	2337
1696	2600
1697	3365
1698	3475
1699	949
1700	2967
1701	2512
1702	3362
1703	3415
1704	3201
1705	3359
1706	1419
1707	2932
1708	3135
1709	2074
1710	2730
1711	2866
1712	3508
1713	2177
1714	2533
1715	495
1716	3181
1717	3317
1718	2609
1719	2725
1720	3246
1721	3374
1722	1218
1723	2972
1724	3091
1725	3424
1726	3210
1727	3505
1728	3090
1729	2068
1730	3018
1731	3098
1732	3422
1733	2104
1734	3070
1735	2929
1736	2111
1737	3395
1738	2417
1739	3221
1740	2745
1741	1202
1742	3452
1743	1310
1744	2677
1745	3002
1746	3007
1747	602
1748	549
1749	1649
1750	108
1751	363
1752	1192
1753	1050
1754	77
1755	1856
1756	2708
1757	123
1758	3046
1759	3531
1760	3516
1761	2620
1762	1475
1763	1554
1764	1735
1765	1549
1766	301
1767	3004
1768	1498
1769	1514
1770	3552
1771	3189
1772	2280
1773	3543
1774	3296
1775	3347
1776	3494
1777	3549
1778	1875
1779	3005
1780	3387
1781	3385
1782	3557
1783	3527
1784	2662
1785	1858
1786	1833
1787	2613
1788	3441
1789	1667
1790	2376
1791	2532
1792	2722
1793	2530
1794	3430
1795	1762
1796	2535
1797	3519
1798	2373
1799	479
1800	1792
1801	2808
1802	3165
1803	504
1804	2404
1805	2748
1806	2986
1807	2412
1808	2643
1809	2816
1810	3431
1811	3432
1812	393
1813	2818
1814	3433
1815	3434
1816	3389
1817	3417
1818	1085
1819	1216
1820	1582
1821	1806
1822	2477
1823	1867
1824	2143
1825	1551
1826	2642
1827	2851
1828	2537
1829	3401
1830	2056
1831	2265
1832	2733
1833	2137
1834	2139
1835	2899
1836	1920
1837	2123
1838	2354
1839	3529
1840	1598
1841	2561
1842	1671
1843	2458
1844	3307
1845	1812
1846	3132
1847	3466
1848	3061
1849	2331
1850	513
1851	1937
1852	3548
1853	1677
1854	3524
1855	3120
1856	414
1857	3263
1858	1016
1859	3497
1860	6425
1861	3014
1862	2350
1863	2418
1864	473
1865	2306
1866	518
1867	2408
1868	2072
1869	1703
1870	438
1871	1461
1872	2473
1873	1592
1874	1713
1875	2375
1876	3392
1877	1126
1878	2335
1879	2379
1880	2381
1881	2786
1882	429
1883	2380
1884	1445
1885	564
1886	38
1887	870
1888	1731
1889	2798
1890	2152
1891	2382
1892	517
1893	1599
1894	3197
1895	2741
1896	2525
1897	3499
1898	1241
1899	3174
1900	3512
1901	3453
1902	2018
1903	3034
1904	2053
1905	3481
1906	3510
1907	3536
1908	3534
1909	3484
1910	3565
1911	1863
1912	3578
1913	3703
1914	2907
1915	3706
1916	3649
1917	3701
1918	3671
1919	3740
1920	3724
1921	3654
1922	3681
1923	3723
1924	3732
1925	3682
1926	3702
1927	3704
1928	3685
1929	3698
1930	3699
1931	3735
1932	3334
1933	3551
1934	2176
1935	2009
1936	3686
1937	3623
1938	2826
1939	3741
1940	3684
1941	3737
1942	3629
1943	3089
1944	2360
1945	2922
1946	2188
1947	3051
1948	3238
1949	2676
1950	3008
1951	3053
1952	3606
1953	2093
1954	3763
1955	2766
1956	3608
1957	1484
1958	3145
1959	3591
1960	3614
1961	2836
1962	3770
1963	2893
1964	3729
1965	3638
1966	3766
1967	3617
1968	3594
1969	3555
1970	2342
1971	3712
1972	2325
1973	3261
1974	166
1975	118
1976	2169
1977	2060
1978	2106
1979	2297
1980	3259
1981	3765
1982	1593
1983	2244
1984	3705
1985	2010
1986	2275
1987	3697
1988	2615
1989	2450
1990	2456
1991	1785
1992	3635
1993	3639
1994	3438
1995	3444
1996	1382
1997	2260
1998	3710
1999	2835
2000	2138
2001	3105
2002	973
2003	3198
2004	3477
2005	3271
2006	3308
2007	3251
2008	1611
2009	3480
2010	3478
2011	1121
2012	2120
2013	3250
2014	1600
2015	2236
2016	1816
2017	3262
2018	3272
2019	3425
2020	1804
2021	408
2022	436
2023	1609
2024	3707
2025	386
2026	2979
2027	2269
2028	2048
2029	2033
2030	2089
2031	2090
2032	3725
2033	3036
2034	2399
2035	3672
2036	3526
2037	2261
2038	3397
2039	2736
2040	2472
2041	2867
2042	2751
2043	3525
2044	3693
2045	2095
2046	2372
2047	2552
2048	3688
2049	2044
2050	3717
2051	2092
2052	2084
2053	3675
2054	242
2055	3599
2056	3708
2057	2803
2058	521
2059	2026
2060	1003
2061	2263
2062	2338
2063	2425
2064	3745
2065	3744
2066	1516
2067	2879
2068	2880
2069	2787
2070	1991
2071	2328
2072	2148
2073	2513
2074	2119
2075	2346
2076	3097
2077	918
2078	2565
2079	2206
2080	3751
2081	3157
2082	2059
2083	2876
2084	2142
2085	2032
2086	3753
2087	695
2088	3017
2089	1327
2090	3440
2091	3783
2092	3566
2093	3571
2094	3787
2095	3556
2096	3626
2097	3535
2098	3580
2099	3618
2100	3752
2101	3514
2102	3083
2103	3521
2104	1119
2105	3129
2106	1397
2107	3183
2108	3637
2109	2844
2110	3079
2111	3158
2112	3655
2113	2304
2114	3559
2115	2577
2116	3584
2117	3586
2118	3577
2119	3576
2120	3627
2121	6184
2122	3055
2123	3792
2124	3633
2125	3771
2126	3819
2127	3812
2128	2891
2129	2813
2130	3727
2131	3459
2132	2902
2133	2422
2134	2531
2135	390
2136	2057
2137	674
2138	2135
2139	2540
2140	1497
2141	2892
2142	2865
2143	649
2144	1904
2145	1279
2146	1236
2147	1585
2148	1809
2149	156
2150	187
2151	1910
2152	2356
2153	1612
2154	2586
2155	278
2156	1413
2157	1922
2158	30
2159	1699
2160	1759
2161	1406
2162	1437
2163	2966
2164	388
2165	2439
2166	1312
2167	149
2168	2024
2169	3148
2170	2166
2171	523
2172	851
2173	2544
2174	2165
2175	2435
2176	2682
2177	506
2178	2283
2179	526
2180	1844
2181	1613
2182	2271
2183	1695
2184	2314
2185	3515
2186	3539
2187	3078
2188	3791
2189	3802
2190	3809
2191	3810
2192	3225
2193	3793
2194	3286
2195	3615
2196	3287
2197	3354
2198	3754
2199	3788
2200	1734
2201	2204
2202	3755
2203	3785
2204	2889
2205	241
2206	2846
2207	2737
2208	1942
2209	2340
2210	1473
2211	1793
2212	3439
2213	2099
2214	2389
2215	1348
2216	2644
2217	2654
2218	1644
2219	1226
2220	1040
2221	3836
2222	3350
2223	1083
2224	3807
2225	3844
2226	2364
2227	2668
2228	3593
2229	3730
2230	3194
2231	3733
2232	3528
2233	1807
2234	2429
2235	2392
2236	451
2237	3384
2238	3405
2239	3208
2240	1389
2241	3767
2242	3683
2243	2660
2244	1924
2245	3032
2246	2526
2247	3814
2248	3801
2249	3619
2250	3760
2251	3834
2252	3813
2253	2181
2254	3832
2255	3846
2256	1180
2257	1934
2258	3398
2259	3054
2260	3658
2261	3095
2262	3624
2263	3826
2264	3646
2265	3567
2266	3784
2267	3616
2268	3719
2269	3564
2270	3797
2271	2227
2272	1679
2273	3692
2274	3825
2275	3798
2276	3743
2277	3355
2278	3409
2279	3190
2280	3454
2281	3662
2282	2232
2283	512
2284	2900
2285	2453
2286	1702
2287	1583
2288	1881
2289	3393
2290	3483
2291	1342
2292	3550
2293	3837
2294	407
2295	2898
2296	3839
2297	1330
2298	1324
2299	2315
2300	1972
2301	1973
2302	1971
2303	2465
2304	2754
2305	2614
2306	1322
2307	1891
2308	1919
2309	2936
2310	3622
2311	1456
2312	3501
2313	2255
2314	3500
2315	3048
2316	2037
2317	486
2318	2888
2319	3394
2320	2041
2321	295
2322	2016
2323	2491
2324	2036
2325	3031
2326	2555
2327	3213
2328	3400
2329	1489
2330	1681
2331	3370
2332	2287
2333	3835
2334	1355
2335	2446
2336	3056
2337	1718
2338	1798
2339	1427
2340	2184
2341	2492
2342	2401
2343	3446
2344	3429
2345	2102
2346	3632
2347	2202
2348	3045
2349	3773
2350	1468
2351	3774
2352	897
2353	3827
2354	3769
2355	3811
2356	1670
2357	3628
2358	2664
2359	2693
2360	2965
2361	3299
2362	3868
2363	3873
2364	3869
2365	2098
2366	3235
2367	1707
2368	3544
2369	2170
2370	499
2371	3043
2372	1440
2373	3313
2374	2296
2375	470
2376	3041
2377	3667
2378	3689
2379	2383
2380	3690
2381	2799
2382	3764
2383	3847
2384	3412
2385	577
2386	3877
2387	1340
2388	152
2389	1331
2390	2163
2391	1969
2392	2789
2393	3696
2394	1999
2395	1341
2396	3660
2397	1987
2398	1995
2399	1329
2400	1977
2401	2122
2402	1623
2403	2740
2404	2868
2405	1976
2406	3021
2407	3840
2408	1326
2409	2655
2410	2790
2411	2878
2412	1980
2413	1993
2414	1978
2415	1979
2416	1992
2417	1323
2418	1981
2419	1325
2420	1328
2421	2982
2422	3186
2423	1661
2424	3179
2425	3831
2426	3590
2427	3861
2428	3841
2429	3159
2430	3328
2431	2713
2432	678
2433	3937
2434	3901
2435	3643
2436	3882
2437	3897
2438	3916
2439	3893
2440	1163
2441	1175
2442	2363
2443	3572
2444	3864
2445	3946
2446	3871
2447	3930
2448	3927
2449	3917
2450	3918
2451	3127
2452	3957
2453	3922
2454	3545
2455	3768
2456	2817
2457	3726
2458	3267
2459	3420
2460	3731
2461	2121
2462	3758
2463	1996
2464	2051
2465	2162
2466	3668
2467	3496
2468	3948
2469	3852
2470	3513
2471	3162
2472	2681
2473	1564
2474	3896
2475	3863
2476	3538
2477	3240
2478	3326
2479	3821
2480	2582
2481	3908
2482	2839
2483	1619
2484	1990
2485	893
2486	3959
2487	3984
2488	3985
2489	3958
2490	3939
2491	3941
2492	3942
2493	1986
2494	3940
2495	2769
2496	3910
2497	3949
2498	3952
2499	3972
2500	3977
2501	3915
2502	3969
2503	3568
2504	3955
2505	2924
2506	2208
2507	3981
2508	3911
2509	3000
2510	3978
2511	3979
2512	3884
2513	3943
2514	3912
2515	3899
2516	3329
2517	567
2518	2534
2519	3372
2520	3470
2521	3342
2522	2983
2523	49
2524	341
2525	129
2526	3713
2527	2937
2528	2618
2529	3849
2530	3728
2531	3217
2532	2385
2533	1447
2534	3738
2535	2494
2536	456
2537	679
2538	3214
2539	3138
2540	2147
2541	3634
2542	938
2543	2827
2544	547
2545	2295
2546	4002
2547	927
2548	2659
2549	4005
2550	3266
2551	3994
2552	4007
2553	4008
2554	3986
2555	3963
2556	3925
2557	4009
2558	3926
2559	2498
2560	4010
2561	2286
2562	4000
2563	2347
2564	2307
2565	3716
2566	2055
2567	3971
2568	2035
2569	3676
2570	1983
2571	3833
2572	2462
2573	2903
2574	2460
2575	3368
2576	3357
2577	3996
2578	3581
2579	2043
2580	3964
2581	2400
2582	3345
2583	3974
2584	2050
2585	4043
2586	3967
2587	4041
2588	4003
2589	4040
2590	3678
2591	2007
2592	633
2593	1439
2594	2597
2595	1503
2596	3206
2597	790
2598	3442
2599	3673
2600	3111
2601	4012
2602	3694
2603	3691
2604	1985
2605	2451
2606	3695
2607	3715
2608	2862
2609	4047
2610	2365
2611	3661
2612	2448
2613	3573
2614	3663
2615	3664
2616	3574
2617	3900
2618	4022
2619	4019
2620	2728
2621	1660
2622	4062
2623	4042
2624	3980
2625	3999
2626	4034
2627	2172
2628	4090
2629	4063
2630	3537
2631	3824
2632	2978
2633	1829
2634	779
2635	3103
2636	4124
2637	4126
2638	4128
2639	4130
2640	4109
2641	4083
2642	4084
2643	4085
2644	4080
2645	4081
2646	1170
2647	4086
2648	1336
2649	2969
2650	3546
2651	1232
2652	3998
2653	4025
2654	2852
2655	3331
2656	3983
2657	4024
2658	4027
2659	3993
2660	4014
2661	4021
2662	4029
2663	4030
2664	4017
2665	4011
2666	4069
2667	2210
2668	3747
2669	4056
2670	3953
2671	4023
2672	4020
2673	4036
2674	4149
2675	4054
2676	4132
2677	4121
2678	4127
2679	4113
2680	4105
2681	1936
2682	3790
2683	4219
2684	4223
2685	1008
2686	3015
2687	2665
2688	4220
2689	4203
2690	4187
2691	4190
2692	4159
2693	4133
2694	3447
2695	4214
2696	4210
2697	4067
2698	4221
2699	4215
2700	4074
2701	4144
2702	4239
2703	4166
2704	106
2705	937
2706	4033
2707	3851
2708	4232
2709	4246
2710	4148
2711	4291
2712	4293
2713	4204
2714	3950
2715	3823
2716	3973
2717	4207
2718	3968
2719	3086
2720	4321
2721	4306
2722	4267
2723	4265
2724	4052
2725	3161
2726	4225
2727	4077
2728	4160
2729	4268
2730	4256
2731	4297
2732	4334
2733	4280
2734	4276
2735	4278
2736	4175
2737	3987
2738	4333
2739	3855
2740	4226
2741	824
2742	670
2743	1859
2744	4037
2745	3928
2746	4103
2747	4117
2748	4361
2749	4322
2750	4082
2751	4262
2752	4091
2753	4353
2754	4039
2755	4102
2756	4138
2757	4123
2758	4275
2759	4115
2760	4089
2761	4125
2762	3391
2763	4355
2764	4349
2765	4310
2766	4018
2767	3858
2768	4327
2769	4329
2770	4359
2771	4326
2772	4351
2773	635
2774	4290
2775	3997
2776	4367
2777	4339
2778	4337
2779	2771
2780	4344
2781	4323
2782	3991
2783	4396
2784	4015
2785	4370
2786	4429
2787	4016
2788	1889
2789	4446
2790	4447
2791	4448
2792	4452
2793	4442
2794	4153
2795	4317
2796	4155
2797	3502
2798	1453
2799	4686
2800	4623
2801	4489
2802	4564
2803	4679
2804	4577
2805	4545
2806	4509
2807	4621
2808	4541
2809	4482
2810	4516
2811	4629
2812	4654
2813	4466
2814	4487
2815	4477
2816	4565
2817	2856
2818	2669
2819	4141
2820	4643
2821	4068
2822	3951
2823	4161
2824	1656
2825	4505
2826	2695
2827	4517
2828	4628
2829	1565
2830	4571
2831	4308
2832	4031
2833	3325
2834	4142
2835	4078
2836	4535
2837	4168
2838	4639
2839	4700
2840	4270
2841	4638
2842	4247
2843	4340
2844	4053
2845	4369
2846	4387
2847	3275
2848	1870
2849	4381
2850	4248
2851	4723
2852	4440
2853	4229
2854	4789
2855	4784
2856	4765
2857	4766
2858	4757
2859	4745
2860	4738
2861	4743
2862	4720
2863	4711
2864	4713
2865	4345
2866	4641
2867	4378
2868	4450
2869	4312
2870	4380
2871	4640
2872	4390
2873	4422
2874	4427
2875	4432
2876	4419
2877	1946
2878	4426
2879	4433
2880	4428
2881	4695
2882	4436
2883	4690
2884	4529
2885	4437
2886	4420
2887	4697
2888	4035
2889	4234
2890	876
2891	4441
2892	4444
2893	4438
2894	4701
2895	4498
2896	4299
2897	4725
2898	4741
2899	4776
2900	4780
2901	4815
2902	4823
2903	4773
2904	4235
2905	4703
2906	4855
2907	4708
2908	4705
2909	4787
2910	4799
2911	4802
2912	4803
2913	4810
2914	4488
2915	4605
2916	4786
2917	4811
2918	4589
2919	4304
2920	4259
2921	4857
2922	4801
2923	4164
2924	4812
2925	4860
2926	4600
2927	4233
2928	4055
2929	4228
2930	4465
2931	1495
2932	1826
2933	4519
2934	3990
2935	3799
2936	4241
2937	917
2938	1460
2939	4835
2940	4833
2941	4718
2942	4865
2943	4231
2944	4242
2945	3378
2946	4617
2947	3906
2948	1824
2949	449
2950	4873
2951	1739
2952	4480
2953	3929
2954	4467
2955	3241
2956	4193
2957	4238
2958	4167
2959	4890
2960	4886
2961	4372
2962	4920
2963	4499
2964	4912
2965	4951
2966	4929
2967	4896
2968	4980
2969	4901
2970	4971
2971	4939
2972	4947
2973	4925
2974	4916
2975	4260
2976	4967
2977	4881
2978	4252
2979	4902
2980	4347
2981	4273
2982	4848
2983	4958
2984	4852
2985	4954
2986	4945
2987	4957
2988	4946
2989	4254
2990	4917
2991	4963
2992	4975
2993	4681
2994	4721
2995	4915
2996	4985
2997	4736
2998	4613
2999	4066
3000	4553
3001	4993
3002	3327
3003	4634
3004	4389
3005	5063
3006	5039
3007	5004
3008	5009
3009	5023
3010	4368
3011	4719
3012	4527
3013	5075
3014	3786
3015	4624
3016	5010
3017	4995
3018	4926
3019	5103
3020	5102
3021	5034
3022	638
3023	5033
3024	3988
3025	4366
3026	5014
3027	4534
3028	4979
3029	4147
3030	4709
3031	3806
3032	4473
3033	4495
3034	3125
3035	1767
3036	4464
3037	4478
3038	1902
3039	5246
3040	5226
3041	5107
3042	4734
3043	4572
3044	4688
3045	4866
3046	5159
3047	5247
3048	5237
3049	4941
3050	4889
3051	4343
3052	4878
3053	4816
3054	4224
3055	5178
3056	5292
3057	4880
3058	4874
3059	4602
3060	4867
3061	5308
3062	4677
3063	5303
3064	5254
3065	4846
3066	5152
3067	5146
3068	4844
3069	4673
3070	4397
3071	3390
3072	4756
3073	5334
3074	5309
3075	5250
3076	5099
3077	5339
3078	5049
3079	4981
3080	4660
3081	4558
3082	4585
3083	4587
3084	4563
3085	1839
3086	4492
3087	4483
3088	4544
3089	4212
3090	5027
3091	4526
3092	2520
3093	2368
3094	4198
3095	4458
3096	4909
3097	4610
3098	3909
3099	4386
3100	4814
3101	4887
3102	4728
3103	4506
3104	4522
3105	4110
3106	5349
3107	4974
3108	5151
3109	5283
3110	5313
3111	5307
3112	4727
3113	4642
3114	3597
3115	5382
3116	5378
3117	4876
3118	4744
3119	5338
3120	4795
3121	5071
3122	5225
3123	5072
3124	4771
3125	4546
3126	4808
3127	4900
3128	5026
3129	4978
3130	5377
3131	4663
3132	5357
3133	5015
3134	5025
3135	4994
3136	5418
3137	5445
3138	4992
3139	4599
3140	4672
3141	5016
3142	5438
3143	4678
3144	4675
3145	4714
3146	5345
3147	5428
3148	5437
3149	5337
3150	4462
3151	4666
3152	5278
3153	5346
3154	5452
3155	4863
3156	5421
3157	5444
3158	5380
3159	5459
3160	4959
3161	4463
3162	4591
3163	5471
3164	4936
3165	5427
3166	4966
3167	5013
3168	5423
3169	5325
3170	5464
3171	4973
3172	5414
3173	5479
3174	5481
3175	4822
3176	5108
3177	5048
3178	5450
3179	5490
3180	5500
3181	4104
3182	4502
3183	4630
3184	5040
3185	5540
3186	5541
3187	5548
3188	5553
3189	5522
3190	5074
3191	5046
3192	5171
3193	5068
3194	5463
3195	5544
3196	3889
3197	4518
3198	4180
3199	5538
3200	5539
3201	5214
3202	5358
3203	5400
3204	5417
3205	5477
3206	4237
3207	5470
3208	5475
3209	5537
3210	4965
3211	5454
3212	1900
3213	5135
3214	4298
3215	4914
3216	5222
3217	5299
3218	5055
3219	5267
3220	5220
3221	5093
3222	5472
3223	5434
3224	3711
3225	5499
3226	5493
3227	5497
3228	5008
3229	4406
3230	4813
3231	5181
3232	4969
3233	5582
3234	4991
3235	5390
3236	5485
3237	5575
3238	5202
3239	4178
3240	5319
3241	2696
3242	4562
3243	4475
3244	5112
3245	4284
3246	5507
3247	5524
3248	4445
3249	2742
3250	4289
3251	5560
3252	5218
3253	4836
3254	4508
3255	3674
3256	5505
3257	5064
3258	5266
3259	5521
3260	5589
3261	5650
3262	5568
3263	4474
3264	5329
3265	5570
3266	4146
3267	3932
3268	4174
3269	5607
3270	2594
3271	3894
3272	4388
3273	2744
3274	4932
3275	5502
3276	5528
3277	5630
3278	5585
3279	4903
3280	4243
3281	5388
3282	3756
3283	5617
3284	5666
3285	5137
3286	4774
3287	4976
3288	5620
3289	5419
3290	5324
3291	5293
3292	5294
3293	5312
3294	5081
3295	5219
3296	5387
3297	5127
3298	5128
3299	5420
3300	5065
3301	5285
3302	5618
3303	5316
3304	4622
3305	4661
3306	5673
3307	5791
3308	5282
3309	5256
3310	5478
3311	5810
3312	5843
3313	5451
3314	4583
3315	5073
3316	5296
3317	5829
3318	4523
3319	2362
3320	4831
3321	5651
3322	5773
3323	4111
3324	5404
3325	5448
3326	5197
3327	4410
3328	4676
3329	4092
3330	3428
3331	5938
3332	5643
3333	4471
3334	5365
3335	5389
3336	5460
3337	2894
3338	522
3339	2848
3340	4927
3341	5881
3342	4294
3343	80
3344	4625
3345	5291
3346	2183
3347	5139
3348	3742
3349	5646
3350	5980
3351	3163
3352	4500
3353	4717
3354	4956
3355	4263
3356	5971
3357	5896
3358	3746
3359	5504
3360	5944
3361	5968
3362	5984
3363	5416
3364	5952
3365	5415
3366	5876
3367	5816
3368	5788
3369	3511
3370	6039
3371	2887
3372	3057
3373	2370
3374	2975
3375	5391
3376	5989
3377	5812
3378	5945
3379	6049
3380	3795
3381	2585
3382	6022
3383	5051
3384	5466
3385	5011
3386	1255
3387	4754
3388	5679
3389	5433
3390	5925
3391	680
3392	5446
3393	5991
3394	5902
3395	5956
3396	5872
3397	4732
3398	5619
3399	1529
3400	1659
3401	5109
3402	6016
3403	5422
3404	5447
3405	5572
3406	5610
3407	3596
3408	5094
3409	3554
3410	3598
3411	5804
3412	1685
3413	5066
3414	6059
3415	5879
3416	5890
3417	6001
3418	5893
3419	5965
3420	4131
3421	5988
3422	6044
3423	5841
3424	5891
3425	5962
3426	5693
3427	5577
3428	6027
3429	5508
3430	6033
3431	4139
3432	5462
3433	5480
3434	5106
3435	3992
3436	6218
3437	5527
3438	5530
3439	5954
3440	5959
3441	5993
3442	6188
3443	3330
3444	5512
3445	6124
3446	4888
3447	4635
3448	5311
3449	5353
3450	5836
3451	5970
3452	5581
3453	4476
3454	4608
3455	2579
3456	1984
3457	5755
3458	4129
3459	3862
3460	5425
3461	5347
3462	5297
3463	488
3464	5328
3465	5682
3466	6213
3467	6246
3468	6051
3469	6169
3470	6060
3471	6238
3472	6030
3473	6104
3474	4616
3475	5625
3476	2069
3477	1123
3478	5272
3479	6254
3480	1571
3481	298
3482	4285
3483	4205
3484	4116
3485	5187
3486	5745
3487	5723
3488	5241
3489	5878
3490	3914
3491	4384
3492	5803
3493	5669
3494	3192
3495	5258
3496	3302
3497	6156
3498	3794
3499	5147
3500	5603
3501	2212
3502	5621
3503	2624
3504	2323
3505	2824
3506	2330
3507	4211
3508	5637
3509	2964
3510	4061
3511	1574
3512	4809
3513	6122
3514	3038
3515	5884
3516	2837
3517	4899
3518	4649
3519	6315
3520	6308
3521	4962
3522	6239
3523	5638
3524	5410
3525	4443
3526	5543
3527	4987
3528	4412
3529	5809
3530	5255
3531	3625
3532	6314
3533	5670
3534	6313
3535	3281
3536	4782
3537	6333
3538	3276
3539	5424
3540	5680
3541	96
3542	5379
3543	5685
3544	4578
3545	5873
3546	4305
3547	5771
3548	1526
3549	5248
3550	6349
3551	6348
3552	6347
3553	6078
3554	6055
3555	5785
3556	5696
3557	5665
3558	5506
3559	5449
3560	5364
3561	5323
3562	5574
3563	5792
3564	6264
3565	6303
3566	2201
3567	2607
3568	6368
3569	6365
3570	6301
3571	6153
3572	6141
3573	6116
3574	6093
3575	6036
3576	6345
3577	6297
3578	6170
3579	6166
3580	6157
3581	6143
3582	4783
3583	4821
3584	3410
3585	4990
3586	5110
3587	4449
3588	4154
3589	1547
3590	6358
3591	5995
3592	6302
3593	6428
3594	6424
3595	6410
3596	5784
3597	6305
3598	4898
3599	4911
3600	5632
3601	5608
3602	6003
3603	4826
3604	6440
3605	6217
3606	5992
3607	6335
3608	5155
3609	5628
3610	5612
3611	760
3612	5684
3613	5615
3614	6002
3615	6378
3616	6281
3617	5435
3618	4849
3619	3323
3620	3947
3621	4383
3622	4919
3623	600
3624	3474
3625	4699
3626	4770
3627	4735
3628	3895
3629	5609
3630	3761
3631	6067
3632	5265
3633	5131
3634	5095
3635	5298
3636	4879
3637	2765
3638	5083
3639	4307
3640	5486
3641	4032
3642	5943
3643	4300
3644	5875
3645	6454
3646	6442
3647	6377
3648	5611
3649	5903
3650	6159
3651	4769
3652	6323
3653	4521
3654	6062
3655	6373
3656	6287
3657	6503
3658	6461
3659	6561
3660	6283
3661	6448
3662	6386
3663	5699
3664	6185
3665	4792
3666	6538
3667	6250
3668	4350
3669	6539
3670	6288
3671	6537
3672	6339
3673	6550
3674	6155
3675	5957
3676	6266
3677	4373
3678	6252
3679	6197
3680	982
3681	5994
3682	4484
3683	1650
3684	993
3685	2179
3686	2743
3687	1398
3688	4316
3689	5863
3690	6565
3691	5563
3692	6579
3693	6385
3694	6534
3695	6636
3696	6183
3697	4255
3698	4970
3699	5629
3700	6617
3701	5168
3702	5483
3703	6744
3704	6268
3705	3870
3706	6422
3707	6732
3708	6370
3709	5114
3710	6679
3711	6645
3712	6624
3713	6588
3714	6572
3715	6551
3716	6330
3717	6285
3718	6192
3719	6187
3720	6058
3721	5818
3722	5501
3723	4157
3724	3888
3725	3879
3726	3150
3727	2782
3728	1941
3729	4439
3730	5644
3731	6708
3732	6552
3733	6596
3734	6564
3735	3182
3736	6595
3737	4156
3738	6269
3739	4921
3740	6541
3741	6798
3742	6659
3743	6662
3744	6663
3745	6658
3746	6476
3747	1430
3748	6709
3749	6787
3750	6788
3751	6791
3752	6777
3753	6776
3754	5021
3755	6390
3756	5321
3757	6620
3758	5668
3759	6350
3760	6820
3761	6850
3762	6856
3763	6754
3764	5663
3765	6810
3766	6582
3767	6718
3768	5209
3769	6638
3770	6720
3771	6560
3772	6628
3773	3112
3774	6862
3775	6296
3776	2652
3777	6774
3778	6816
3779	6807
3780	6809
3781	6322
3782	6851
3783	6811
3784	6832
3785	6812
3786	6631
3787	6574
3788	6591
3789	6319
3790	2634
3791	6893
3792	6814
3793	5649
3794	5116
3795	6808
3796	6383
3797	6357
3798	5999
3799	6857
3800	6337
3801	4847
3802	5562
3803	6874
3804	6873
3805	6711
3806	6898
3807	6911
3808	6753
3809	6879
3810	5747
3811	6334
3812	4953
3813	6934
3814	6942
3815	6376
3816	6867
3817	6331
3818	6944
3819	5880
3820	6863
3821	6796
3822	6193
3823	5498
3824	6341
3825	6042
3826	5077
3827	5461
3828	6936
3829	6702
3830	6568
3831	5941
3832	6586
3833	7121
3834	7102
3835	7107
3836	7093
3837	7049
3838	7050
3839	7054
3840	7052
3841	7057
3842	7059
3843	7048
3844	7053
3845	7085
3846	7082
3847	7051
3848	7018
3849	7009
3850	7036
3851	7004
3852	6999
3853	7013
3854	7015
3855	7019
3856	7033
3857	6979
3858	6974
3859	6963
3860	6947
3861	7012
3862	6890
3863	5170
3864	6382
3865	6953
3866	7143
3867	6689
3868	963
3869	6932
3870	6219
3871	6593
3872	6367
3873	6536
3874	6375
3875	4961
3876	5531
3877	5322
3878	5678
3879	5529
3880	5080
3881	5264
3882	7149
3883	6870
3884	5955
3885	6950
3886	6927
3887	5633
3888	7153
3889	6773
3890	6696
3891	5820
3892	7151
3893	6790
3894	6324
3895	7080
3896	7060
3897	7045
3898	7158
3899	7223
3900	7216
3901	7212
3902	7211
3903	7215
3904	6549
3905	1546
3906	6545
3907	7104
3908	7193
3909	6517
3910	3898
3911	4573
3912	6510
3913	7236
3914	6780
3915	6797
3916	7076
3917	5601
3918	7137
3919	7147
3920	6993
3921	7247
3922	7091
3923	7101
3924	7046
3925	7007
3926	7000
3927	6996
3928	1928
3929	4798
3930	6225
3931	5752
3932	4158
3933	5700
3934	7155
3935	6012
3936	5363
3937	7173
3938	7162
3939	2590
3940	2180
3941	7285
3942	4704
3943	6592
3944	7311
3945	7254
3946	6567
3947	7022
3948	7090
3949	1827
3950	3003
3951	4152
3952	4313
3953	4644
3954	6041
3955	6969
3956	7123
3957	6978
3958	2691
3959	6902
3960	7038
3961	6971
3962	7251
3963	6713
3964	5817
3965	6215
3966	4407
3967	6881
3968	7034
3969	6332
3970	6178
3971	6380
3972	5062
3973	7265
3974	6571
3975	6688
3976	6294
3977	5949
3978	7156
3979	7340
3980	5772
3981	1107
3982	6965
3983	7139
3984	1926
3985	7323
3986	7354
3987	7352
3988	7317
3989	6760
3990	3310
3991	7305
3992	5899
3993	7184
3994	6548
3995	7261
3996	6765
3997	7347
3998	5826
3999	5947
4000	6887
4001	6581
4002	5398
4003	7263
4004	7361
4005	3966
4006	7414
4007	6764
4008	7386
4009	6286
4010	7092
4011	5963
4012	6235
4013	7058
4014	6242
4015	6584
4016	7318
4017	7373
4018	7367
4019	7375
4020	7381
4021	4189
4022	5779
4023	6427
4024	4740
4025	6249
4026	7376
4027	4636
4028	7372
4029	7371
4030	2884
4031	7310
4032	6563
4033	6755
4034	7293
4035	7062
4036	7493
4037	7479
4038	7624
4039	7614
4040	7579
4041	7716
4042	7714
4043	7438
4044	7150
4045	7766
4046	7728
4047	7839
4048	7826
4049	7822
4050	7900
4051	7882
4052	7154
4053	6338
4054	5900
4055	6006
4056	5874
4057	6014
4058	4989
4059	6687
4060	6566
4061	6484
4062	6686
4063	6946
4064	6958
4065	6888
4066	6886
4067	8008
4068	7325
4069	7757
4070	7142
4071	8153
4072	8119
4073	6752
4074	6750
4075	6949
4076	7454
4077	7934
4078	7802
4079	7698
4080	8042
4081	6619
4082	8232
4083	8228
4084	7842
4085	6216
4086	7619
4087	8266
4088	7458
4089	6374
4090	8293
4091	6005
4092	8302
4093	8361
4094	8382
4095	6434
4096	8462
4097	8461
4098	8459
4099	8458
4100	8451
4101	8450
4102	8463
4103	8482
4104	8481
4105	7163
4106	8493
4107	8492
4108	7160
4109	7218
4110	7303
4111	6452
4112	3872
4113	8154
4114	8507
4115	7944
4116	8518
4117	8447
4118	5915
4119	5440
4120	3965
4121	6299
4122	6279
4123	7161
4124	5523
4125	8542
4126	8387
4127	8290
4128	8169
4129	8368
4130	7894
4131	7256
4132	7348
4133	5801
4134	6984
4135	8591
4136	6639
4137	7702
4138	6990
4139	5525
4140	4796
4141	8057
4142	8487
4143	7727
4144	7078
4145	1496
4146	8446
4147	6603
4148	5007
4149	3714
4150	6162
4151	7026
4152	5694
4153	6957
4154	8611
4155	8610
4156	8617
4157	8614
4158	5341
4159	2847
4160	8464
4161	8528
4162	6542
4163	8623
4164	6706
4165	8633
4166	8596
4167	8636
4168	4409
4169	8622
4170	7439
4171	6280
4172	5636
4173	7079
4174	8529
4175	6527
4176	2612
4177	7177
4178	6660
4179	2205
4180	7167
4181	8502
4182	425
4183	6614
4184	6090
4185	5951
4186	6547
4187	5375
4188	7646
4189	6407
4190	5455
4191	5213
4192	7840
4193	8714
4194	8712
4195	8711
4196	8695
4197	6493
4198	6616
4199	8640
4200	6954
4201	7482
4202	4595
4203	7449
4204	7264
4205	8796
4206	7299
4207	6699
4208	6535
4209	6502
4210	7116
4211	6063
4212	8360
4213	8370
4214	8366
4215	7879
4216	8014
4217	8535
4218	7073
4219	8665
4220	7294
4221	941
4222	7326
4223	4818
4224	8743
4225	8581
4226	5231
4227	8827
4228	4459
4229	8644
4230	8783
4231	8641
4232	7980
4233	4296
4234	7219
4235	5802
4236	2757
4237	8167
4238	3641
4239	7028
4240	7027
4241	7069
4242	4537
4243	7647
4244	8798
4245	7581
4246	8638
4247	8532
4248	8533
4249	8784
4250	7346
4251	7896
4252	5707
4253	6985
4254	2442
4255	7178
4256	7008
4257	7179
4258	7084
4259	7387
4260	7366
4261	7044
4262	8207
4263	7706
4264	6270
4265	6783
4266	8574
4267	6666
4268	7088
4269	5974
4270	6433
4271	6533
4272	1490
4273	7570
4274	6025
4275	7205
4276	8880
4277	8875
4278	5796
4279	1929
4280	6793
4281	3553
4282	7569
4283	6405
4284	5113
4285	1932
4286	5690
4287	7394
4288	3865
4289	8833
4290	2674
4291	6884
4292	6223
4293	5688
4294	6868
4295	6883
4296	6220
4297	8810
4298	8666
4299	8865
4300	2514
4301	5584
4302	6695
4303	7103
4304	6625
4305	3843
4306	1655
4307	6298
4308	6523
4309	6981
4310	8879
4311	6710
4312	2432
4313	6880
4314	2515
4315	6852
4316	970
4317	7324
4318	8410
4319	8866
4320	8921
4321	7448
4322	1887
4323	6909
4324	6181
4325	8937
4326	6598
4327	4191
4328	7451
4329	6306
4330	7789
4331	6786
4332	7445
4333	8521
4334	7208
4335	7888
4336	8753
4337	7061
4338	8910
4339	6554
4340	1940
4341	6201
4342	8235
4343	2801
4344	3306
4345	5012
4346	5799
4347	6163
4348	6785
4349	7380
4350	976
4351	5602
4352	8044
4353	7883
4354	1933
4355	6232
4356	5384
4357	5177
4358	6336
4359	6869
4360	6477
4361	6772
4362	7713
4363	8424
4364	7772
4365	6020
4366	7074
4367	8364
4368	6195
4369	7070
4370	8961
4371	7362
4372	8138
4373	956
4374	7075
4375	9018
4376	8987
4377	8372
4378	7364
4379	8950
4380	7255
4381	6768
4382	8874
4383	8969
4384	1913
4385	8645
4386	7319
4387	7165
4388	6837
4389	4871
4390	8781
4391	6959
4392	6212
4393	31000
4394	31083
4395	8158
4396	8949
4397	27706
4398	8376
4399	8575
4400	7175
4401	27728
4402	5401
4403	4862
4404	3211
4405	7845
4406	8965
4407	8268
4408	7450
4409	6320
4410	8972
4411	30707
4412	30810
4413	8958
4414	8977
4415	30812
4416	8984
4417	30816
4418	30825
4419	27808
4420	8943
4421	8981
4422	8966
4423	8948
4424	8951
4425	8985
4426	8917
4427	6295
4428	7169
4429	7176
4430	8983
4431	6618
4432	7444
4433	8808
4434	8643
4435	7259
4436	7315
4437	5443
4438	5675
4439	5882
4440	6721
4441	2807
4442	8371
4443	4453
4444	6196
4445	5409
4446	7017
4447	5580
4448	1675
4449	7192
4450	31221
4451	30822
4452	5787
4453	8534
4454	8835
4455	6992
4456	6265
4457	1068
4458	5573
4459	8807
4460	8373
4461	8375
4462	8465
4463	4171
4464	8970
4465	8957
4466	5712
4467	7063
4468	7089
4469	7396
4470	6509
4471	6684
4472	8128
4473	5847
4474	26313
4475	31038
4476	8571
4477	7587
4478	7099
4479	5333
4480	6920
4481	6387
4482	6989
4483	3822
4484	7064
4485	8012
4486	5782
4487	7981
4488	3789
4489	2697
4490	7924
4491	7932
4492	6234
4493	31030
4494	27741
4495	31433
4496	8864
4497	6609
4498	7357
4499	27820
4500	8907
4501	27801
4502	8869
4503	8782
4504	6245
4505	8650
4506	31696
4507	7742
4508	6967
4509	6140
4510	7982
4511	5105
4512	6148
4513	6975
4514	8620
4515	4794
4516	7115
4517	7564
4518	5909
4519	7650
4520	8035
4521	7114
4522	8727
4523	6665
4524	8778
4525	4827
4526	4715
4527	2175
4528	7023
4529	2589
4530	7782
4531	6994
4532	8132
4533	6723
4534	5657
4535	7031
4536	6417
4537	7032
4538	284
4539	4200
4540	2196
4541	8118
4542	6577
4543	4748
4544	3353
4545	4374
4546	27838
4547	26791
4548	7815
4549	128
4550	6987
4551	8011
4552	8015
4553	8607
4554	8873
4555	8191
4556	32116
4557	8587
4558	7248
4559	32019
4560	7087
4561	6948
4562	27873
4563	6912
4564	6951
4565	7649
4566	27822
4567	7117
4568	8908
4569	8799
4570	26865
4571	8183
4572	30818
4573	7056
4574	27882
4575	27768
4576	32031
4577	7234
4578	6515
4579	7171
4580	8336
4581	5672
4582	4850
4583	27846
4584	8861
4585	6597
4586	6482
4587	31685
4588	26422
4589	5397
4590	27912
4591	8338
4592	25841
4593	25827
4594	25886
4595	7720
4596	8968
4597	32587
4598	8813
4599	26680
4600	26084
4601	8016
4602	7360
4603	8147
4604	4626
4605	7561
4606	6395
4607	6629
4608	2784
4609	6731
4610	1337
4611	7492
4612	6327
4613	8426
4614	27317
4615	7118
4616	8157
4617	8340
4618	6678
4619	6707
4620	3013
4621	3563
4622	2651
4623	2625
4624	1771
4625	8501
4626	7308
4627	6203
4628	5749
4629	5165
4630	5588
4631	5640
4632	4800
4633	4645
4634	2992
4635	2298
4636	4611
4637	2257
4638	8024
4639	4581
4640	7127
4641	4079
4642	5635
4643	8914
4644	7390
4645	32596
4646	30820
4647	30749
4648	8337
4649	31878
4650	8870
4651	8385
4652	30846
4653	33004
4654	27821
4655	7379
4656	27815
4657	33162
4658	7345
4659	30850
4660	2211
4661	8938
4662	27803
4663	33493
4664	2927
4665	26131
4666	7336
4667	6123
4668	4399
4669	8270
4670	7206
4671	7209
4672	5047
4673	6885
4674	7024
4675	8512
4676	6918
4677	7573
4678	8195
4679	7745
4680	8253
4681	9010
4682	8667
4683	7377
4684	27839
4685	5901
4686	2107
4687	4733
4688	8967
4689	6827
4690	7701
4691	8916
4692	5597
4693	6669
4694	8199
4695	8121
4696	5867
4697	7773
4698	6530
4699	27834
4700	6650
4701	32029
4702	32296
4703	33166
4704	27773
4705	31410
4706	27721
4707	33679
4708	8955
4709	6667
4710	33794
4711	7700
4712	6086
4713	7257
4714	31225
4715	33154
4716	7072
4717	6724
4718	4338
4719	32017
4720	32022
4721	1507
4722	34048
4723	8774
4724	8771
4725	8773
4726	8973
4727	34150
4728	33660
4729	8982
4730	6983
4731	31420
4732	32770
4733	32632
4734	32584
4735	31702
4736	31692
4737	31658
4738	31610
4739	31437
4740	27899
4741	27776
4742	26375
4743	25773
4744	33164
4745	33669
4746	6035
4747	34162
4748	27788
4749	33145
4750	33495
4751	30793
4752	3859
4753	4977
4754	7925
4755	34319
4756	7132
4757	34359
4758	4046
4759	31694
4760	7164
4761	2905
4762	30898
4763	32289
4764	31923
4765	7327
4766	6031
4767	8530
4768	7382
4769	7920
4770	7419
4771	7620
4772	5735
4773	34528
4774	4184
4775	6289
4776	25856
4777	7810
4778	26965
4779	6291
4780	34534
4781	34334
4782	26172
4783	5604
4784	34536
4785	8836
4786	33836
4787	6962
4788	34338
4789	34072
4790	36519
4791	7940
4792	1572
4793	4404
4794	7748
4795	8405
4796	6023
4797	6770
4798	31427
4799	3838
4800	6400
4801	7584
4802	1757
4803	32598
4804	27831
4805	36525
4806	8809
4807	32011
4808	8526
4809	37729
4810	25927
4811	27878
4812	26578
4813	34405
4814	7297
4815	33672
4816	8919
4817	37736
4818	1652
4819	7055
4820	7083
4821	7812
4822	34326
4823	4552
4824	3919
4825	39427
4826	33677
4827	37720
4828	7767
4829	38038
4830	31903
4831	33639
4832	39234
4833	27790
4834	33646
4835	26776
4836	40278
4837	8019
4838	7572
4839	3816
4840	4804
4841	5121
4842	40815
4843	2810
4844	8730
4845	39292
4846	5465
4847	40819
4848	26662
4849	7820
4850	6858
4851	8928
4852	8860
4853	34153
4854	40583
4855	7235
4856	38886
4857	35836
4858	34336
4859	41569
4860	3989
4861	40826
4862	5279
4863	7983
4864	34542
4865	41566
4866	26242
4867	26386
4868	26152
4869	26870
4870	7753
4871	27416
4872	4292
4873	7841
4874	25825
4875	42723
4876	41997
4877	8915
4878	33437
4879	39183
4880	6466
4881	6273
4882	3364
4883	25940
4884	3739
4885	7301
4886	8979
4887	8600
4888	7217
4889	7705
4890	6101
4891	7320
4892	41285
4893	6966
4894	7181
4895	8341
4896	32582
4897	36529
4898	38798
4899	8094
4900	4998
4901	8830
4902	36517
4903	35957
4904	27837
4905	37727
4906	34437
4907	2611
4908	25753
4909	6970
4910	7190
4911	959
4912	36527
4913	8125
4914	929
4915	43871
4916	39231
4917	2187
4918	37857
4919	39444
4920	34148
4921	34532
4922	34271
4923	25898
4924	25999
4925	25996
4926	25795
4927	25937
4928	33615
4929	8989
4930	7440
4931	43928
4932	43708
4933	5489
4934	44191
4935	36276
4936	37733
4937	2185
4938	36537
4939	37741
4940	40966
4941	6125
4942	26704
4943	6453
4944	7025
4945	7831
4946	4614
4947	27592
4948	31700
4949	40629
4950	42002
4951	26171
4952	37545
4953	25769
4954	41527
4955	7832
4956	7834
4957	7833
4958	7835
4959	44665
4960	36401
4961	7618
4962	37739
4963	26303
4964	7333
4965	32009
4966	44195
4967	40959
4968	6465
4969	4687
4970	26151
4971	39449
4972	39446
4973	7936
4974	45210
4975	43396
4976	44199
4977	44204
4978	39400
4979	37830
4980	45186
4981	41573
4982	44972
4983	37386
4984	33725
4985	42418
4986	42018
4987	42738
4988	8939
4989	32302
4990	45499
4991	45447
4992	42004
4993	3680
4994	44761
4995	38388
4996	40614
4997	43912
4998	41863
4999	40946
5000	7762
5001	35015
5002	45950
5003	38061
5004	42730
5005	4988
5006	46530
5007	33421
5008	43917
5009	42009
5010	7460
5011	45722
5012	41716
5013	3455
5014	7616
5015	45517
5016	8604
5017	6480
5018	45501
5019	47122
5020	6748
5021	5853
5022	4928
5023	27904
5024	3587
5025	8239
5026	6100
5027	7749
5028	33188
5029	42732
5030	2071
5031	8656
5032	8838
5033	47044
5034	39307
5035	41571
5036	5986
5037	6214
5038	37240
5039	43936
5040	45062
5041	43556
5042	5240
5043	43921
5044	44864
5045	5969
5046	27879
5047	7884
5048	27660
5049	33826
5050	8677
5051	31049
5052	4356
5053	8952
5054	31101
5055	36708
5056	45382
5057	45728
5058	7001
5059	46578
5060	46970
5061	3653
5062	2984
5063	6938
5064	45668
5065	40339
5066	6145
5067	8906
5068	48516
5069	44399
5070	45442
5071	7939
5072	4451
5073	7938
5074	42015
5075	26504
5076	7930
5077	27020
5078	27523
5079	42632
5080	27266
5081	33683
5082	8795
5083	8832
5084	8093
5085	4964
5086	27869
5087	7743
5088	7411
5089	45730
5090	45720
5091	44022
5092	6251
5093	36509
5094	4785
5095	27397
5096	26082
5097	8582
5098	33896
5099	31364
5100	5244
5101	40732
5102	39869
5103	32387
5104	27850
5105	27865
5106	2557
5107	26840
5108	7976
5109	33138
5110	42011
5111	34520
5112	48783
5113	45880
5114	48780
5115	47610
5116	45431
5117	46965
5118	46948
5119	4403
5120	4195
5121	37384
5122	43679
5123	48877
5124	26838
5125	46723
5126	6300
5127	42728
5128	46976
5129	48593
5130	8947
5131	42007
5132	33903
5133	30894
5134	39381
5135	26606
5136	27193
5137	31184
5138	36535
5139	49274
5140	45028
5141	47518
5142	45074
5143	45361
5144	45672
5145	49272
5146	48982
5147	48385
5148	45928
5149	46850
5150	25870
5151	6244
5152	44709
5153	7141
5154	43460
5155	4218
5156	5238
5157	42740
